# 1)დაპრინტეთ თქვენი ოჯახის წევრების სახელები ტერმინალში 
# 2)შექმენით მეორე ფაილი სადაც გაამწარებთ იმ მიმის სახეს(extension-ს ქვია incredibly in your face) 20 შეცდომით 
#    (ესეც დასქრინეთ და ჩააგდეთ  day 3 homework ფოლდერში)
# 3) სოლოლერნში: text data შეასრულეთ, დასქრინეთ და ჩააგდეთ day 3 homework ფოლდერში

 1)დაპრინტეთ თქვენი ოჯახის წევრების სახელები ტერმინალში 
2)შექმენით მეორე ფაილი სადაც გაამწარებთ იმ მიმის სახეს(extension-ს ქვია incredibly in your face) 20 შეცდომით 
   (ესეც დასქრინეთ და ჩააგდეთ  day 3 homework ფოლდერში)
3) სოლოლერნში: text data შეასრულეთ, დასქრინეთ და ჩააგდეთ day 3 homework ფოლდერში
1)დაპრინტეთ თქვენი ოჯახის წევრების სახელები ტერმინალში 
2)შექმენით მეორე ფაილი სადაც გაამწარებთ იმ მიმის სახეს(extension-ს ქვია incredibly in your face) 20 შეცდომით 
   (ესეც დასქრინეთ და ჩააგდეთ  day 3 homework ფოლდერში)
3) სოლოლერნში: text data შეასრულეთ, დასქრინეთ და ჩააგდეთ day 3 homework ფოლდერში