📜  // ეკრანზე გამოტანა - სტანდარტული გამომავალი ნაკადი

📜  // /n - ახალ ხაზზე ბეჭდავს

📜  // printf - რაც  არის პირველი არგუმენტი (პირველ მძიმემდე) ის გამოყავს 
// "სტანდარტულ აუთფუთ სტრიმში". მარტივად რომ ვთქვათ "ეკრანზე".

📜  // ეკრანზე გამოტანა - სტანდარტულ გამომავალი ნაკადი

📜  // %d - სპეციფიკატორი (placeholder) ანუ ადგილის დამჭერი. ის გვეუბნება, რომ ამ
// ადგილას უნდა ჩაჯდეს რაღაც ცვლადი.

📜  // ამ კოდში: int a[] = {1, 3, 2}; - printf-ი გამოიტანს მაქსიმალურ 
// მნიშვნელობას 3-ს, ხოლო ინდექსს 1-ს


📜  // return 0 - ით ჩვენ ვხვდებით, რომ თუ რამე შეცდომა დავუშვით ამ რიცხვით 
// ვხვდებით რომ ჩვენ შეცდომა დავუშვით, ანუ როგორ იმუშავა ჩვენმა კოდმა. 
// ანუ ჩვენ ამ რიცხვით ვხვდებით თუ  როგორ მთავრდება. 
//0-ის მაგივრად შეგვიძლია დავწეროთ ნებისმიერი რიცხვი.

📜  // %d - placeholder (ადგილის დამჭერი)

📜  // 

📜  // 

📜  // 