# 1) მომხმარებელს შემოატანინეთ ორი რიცხვი, შემოტანის შემდეგ for 
# ციკლის გამოყენებით გამოუტანეთ რიცხვები ორი შემოტანილი
# რიცხვის დიაპაზონში, მაგალითად თუ მომხმარებელმა შემოიტანა 4 და 8,
# გამოუტანეთ რიცხვები 4,5,6,7,8

# num1 = int(input("number 1: "))
# num2 = int(input("number 2: "))

# for i in range(num1, num2 + 1):
#     print(i)


# 2) წინა დავალებას როცა გააკეთებთ შემდეგ შექმენით პროგრამა 
# რომელიც გამოიტანს რიცხვთა ჯამს იმ დიაპაზონში,
# მაგ 5-8, გამოუტანეთ ჯამი 5 + 6 + 7 + 8
    
# num1 = int(input("number 1: "))
# num2 = int(input("number 2: "))




# 3) გამოიტანეთ რიცხვები 1 დან 10_ჩათვლით for  ციკლის გამოყენებით, 
# მაგრამ თითოეული რიცხვი აიყვანეთ კვადრატში ანუ მეორე ხარისხში აყვანა

