#print(5 == 5)  # 5 თუ უდრის 5-ს
#print(5 == 7)  # 5 თუ უდრის 7-ს
#print(5 != 7)  # 5 არ უდრის 7-ს
#print(5 != 5)  # 5 არ უდრის 5-ს
#print(5 <= 5)  # 5 ნაკლებია ან ტოლია 5-ის
#print(5 >= 5)  # 5 მეტია ან ტოლია 5-ის

#---------------------------------------------------


#  for i in range(21):

#      print(i)

# for ი ეს არის ციკლის keyword
# i არის საიტერაციო ცვლადი  (იტერაცია ნიშნავს განმეორება)
# in არის ში ხოლო in range არის დიაპაზონში
# range(20) ნიშნავს, რომ შეიქმნება მათემატიკური მიმდევრობა რომლის სიგრძეც არის 20
# range არის მეთოდი რომელსაც არგუმენტად გადაეცა მნიშვნელობა 20

#------------------------------------------------------------------------


#  age = int(input(" what is your age? :"))
#  while  age < 18:
#      print("you aren't adult")

# i = 0 ეს არის საიტერაციო ცვლადის დეკლარაცია
# while(სანამ) ეს არის ციკლის შესაქმნელად საჭირო keyword ი
# ციკლი იმუშავებს იქამდე სანამ i ნაკლებია 41
# თითოეულ დატრიალებაზე დაიპრინტება ჩვენი საიტერაციო ცვლადი i
# რომელიც მნიშვნელობას იზრდის 1 ით
# i += 1 ეს არის საიტერაციო ცვლადის ინკრემენტაცია (გაზრდა)

#------------------------------------------------------------------------

# ვთქვათ პაროლი არის 12345 და მომხმარებელმა შეიყვანა 678

# guess = int(input("enter your password: ")) 
# password = 12345  
# while guess != password: 
#     guess = int(input("enter your password: "))
# print("password is correct")

#------------------------------------------------------------------------

# sequensing - თანმიმდევრობა 
# iteration - ინტერაცია (გამეორება)
# selection - არჩრვა

#-----------------------------------------------------

#age = int(input("what is your age: "))

#if age <= 18:
#    print("is aris patara") 
#else:
#    print("is ukve didia")

#-----------------------------------------------------------